tutorials/pisoHFDIBFoam/impeller/Allrun
#!/bin/sh

blockMesh
decomposePar -force -copyUniform
mpirun -np 6 pimpleHFDIBFoam -parallel


# ----------------------------------------------------------------- end-of-file
